{
    "COMMON": {
        "title": "Dey Apps",
        "home": "Home",
        "infoMtm": "App MtM",
        "subtitle": "Home Software Developer",
        "contact": "Contact: deyhome.mtm@gmail.com",
        "footer": "Copyright © 2020 - David Jiménez - All rigths reserved",
        "iconDesignedBy": "Icons designed by {{url}}",
        "MTM_LARGE": "Motor Track Manager",
        "MTM_FREE": "MtM Free",
        "light": "Light",
        "dark": "Dark",
        "sky": "Sky"
    },
    "HOME": {
        "titleInfoDeveloper": "Developer Information",
        "descriptionInfoDeveloper": "My professional career is mostly in IT consulting, participating in large international clients. I have evolved mainly in the technological field of software engineering, although I have also participated in project management tasks. I consider myself a proactive person with an objective of continuous professional improvement.",
        "titleProjects": "Projects",
        "descriptionProjects": "Application to manage the maintenance of personal vehicles without having to remember when a review was made and how much is left for the next oil change of your motorcycle or car.",
        "descriptionLargeProjects": "Application to manage the maintenance of personal vehicles without having to remember when a review was made and how much is left for the next oil change of your motorcycle or car. It helps you to know at any time when you should pass the next review and the life of your vehicle parts by configuring each maintenance in a personalized way.",
        "titleTechnologicalSkills": "Tecnological Skills",
        "descriptionTechnologicalSkills": "My technological concerns have led me to master Microsoft programming tools and languages, such as .NET Framework, .NET CORE, Entity Framework or Sql Server. I have also had the opportunity to evolve in Google technology such as Angular, firebase or Play Store. Besides, as I personally like to try everything, I have been able to work with Ionic and Cordova for multiplatform mobile technologies.",
        "titleHobbies": "Hobbies",
        "descriptionHobbies": "Finally, so you can know me a little more, outside the professional environment I spend my free time with the world of motor, I am passionate about creating games with tools like UnReal and mobile technologies with Android. To take care of myself a little, I enjoy adventure sports, hiking, mountain biking, skating, basketball, etc. Of course, I love spending time with family and friends."
    },
    "INFO_MTM": {
        "titleExpensesVehicles": "Expenses per vehicles",
        "descriptionExpensesVehicles": "Manage and control the expenses for each vehicle or as a whole. Once you have configured all your vehicles and their maintenance operations in the application, you will be able to have available some graphs with the total expenses or also filtering the data that you want.",
        "titleCalendar": "Calendar",
        "descriptionCalendar": "One of the comforts of traveling by motorcycle is knowing that all the maintenance is in order. With the help of the calendar you will be able to plan the revisions and anticipate possible breakdowns due to not having changed a part in due time. This calendar calculates the date on which you should carry out the configured revisions based on the kilometers performed",
        "titleExpensesReplacement": "Expenses per replacements",
        "descriptionExpensesReplacement": "Visualize the expenses invested in your vehicles for each part replaced in maintenance or breakdowns. Once you have configured your vehicles and performed some maintenance, you will be able to check the total or filtered expenses of the parts used in the reports.",
        "titleNotifications": "Notificaciones",
        "descriptionNotifications": "The application allows you to define personalized maintenance for each of your vehicles. Based on these configurations, it notifies you how long and how many kilometers the parts of your vehicles have lived.",
        "titleTechnologiesUsed": "Technologies Used",
        "descriptionTechnologiesUsed": "Multiplatform application for Android and Windows 10. Implemented with the Ionic 6 and Angular 12 frameworks. With the help of VS Code it has been possible to develop with the programming languages HTML5, CSS3, Typescript 4 and SQL. The best code quality is guaranteed by using SonarQube.",
        "descriptionMtMFree": "The application is also available for free but with reduced functionality. Still with this version you can use the vehicle registration, operations, a wide range of configurations for maintenance and notifications. Using the complete application you could enjoy the calendar alerts, cost control and summary of maintenance and spare parts."
    },
    "POLICY_PRIVACY": {
        "mtmPrivacyPolicy": "Privacy Policy of Motor track Manager",
        "title": "PRIVACY POLICY",
        "lastUpdate": "Last Update: January 2021",
        "userInformation": "USER INFORMATION",
        "userInformationDescription": "DeyApps, as Data Controller, informs you that, in accordance with the provisions of Regulation (EU) 2016/679, of 27 April, (RGPD) and the L.O. 3/2018, of 5 December, on data protection and guarantee of digital rights (LOPDGDD), we will treat your data as we reflect in this Privacy Policy. In this Privacy Policy we describe how we collect your personal data and why we collect it, what we do with it, who we share it with, how we protect it and your choices regarding the processing of your personal data. This Policy applies to the processing of your personal data collected by the company for the provision of its services. If you agree to the measures in this Policy, you consent to our processing of your personal data as defined in this Policy. Translated with www.DeepL.com/Translator (free version)",
        "contact": "CONTACT",
        "company": "DeyApps",
        "companyContact": "deyhome.mtm@gmail.com",
        "mainPrinciples": "MAIN PRINCIPLES",
        "mainPrinciplesDescription1": "We have always been committed to providing our services with the highest degree of quality, which includes treating your data with security and transparency. Our principles are:",
        "mainPrinciplesDescription2": "Lawfulness: we will only collect your Personal Data for specified, explicit and legitimate purposes.",
        "mainPrinciplesDescription3": "Data minimization: We limit the collection of Personal Data to what is strictly relevant and necessary for the purposes for which it was collected.",
        "mainPrinciplesDescription4": "Purpose limitation: We will only collect your personal data for the stated purposes and only according to your wishes.",
        "mainPrinciplesDescription5": "Accuracy: We will keep your personal data accurate and up to date.",
        "mainPrinciplesDescription6": "Data Security: We implement appropriate technical and organizational measures commensurate with the risks to ensure that your data is not damaged, such as unauthorized disclosure or access, accidental or unlawful destruction or accidental loss or alteration and any other form of unlawful processing.",
        "mainPrinciplesDescription7": "Access and Rectification: We have the means for you to access or rectify your data whenever you consider it appropriate.",
        "mainPrinciplesDescription8": "Retention: We retain your personal data in a lawful and appropriate manner and only as long as necessary for the purposes for which it was collected.",
        "mainPrinciplesDescription9": "International transfers: Where your data is to be transferred outside the EU/EEA it will be adequately protected.",
        "mainPrinciplesDescription10": "Third parties: access and transfer of personal data to third parties are carried out in accordance with applicable laws and regulations and with appropriate contractual safeguards.",
        "mainPrinciplesDescription11": "Direct Marketing and Cookies: We comply with applicable advertising and cookie legislation.",
        "processingData": "COLLECTION AND PROCESSING OF YOUR PERSONAL DATA",
        "processingDataDescription1": "The types of data that can be requested in the application will be only to process the vehicle maintenance data but without ever identifying the vehicle itself or its owner or the user of the application. This data can be extracted manually from the application and it will be the user who has full control over their vehicle data so that they can be integrated into the same application but in a different device. The way to save this information will be to request access to the paths of your device and to be able to leave the required information in a location on the device.",
        "processingDataDescription2": "In no case will this data be automatically collected and forwarded to be processed by external services. In the event that any personal data is required, we will always request it in advance and inform you clearly what personal data we collect and for what purpose.",
        "legitimacy": "LEGITIMACY",
        "legitimacyDescription1": "In accordance with the applicable data protection regulations, your personal data may be processed provided that:",
        "legitimacyDescription2": "You have given us your consent for the purposes of processing. You may of course withdraw your consent at any time.",
        "legitimacyDescription3": "By legal requirement.",
        "legitimacyDescription4": "Because there is a legitimate interest that is not undermined by your privacy rights, such as sending commercial information either by subscribing to our newsletter or by your status as a customer.",
        "legitimacyDescription5": "For being necessary for the provision of any of our services through a contractual relationship between you and us.",
        "comunicationData": "COMMUNICATION OF PERSONAL DATA",
        "comunicationDataDescription": "The data may be communicated to companies related to DeyApps for the provision of various services as Data Processors. The company will not make any transfer, except by legal obligation.",
        "userRights": "YOUR RIGHTS",
        "userRightsDescription1": "In connection with the collection and processing of your personal data, you can contact us at any time to:",
        "userRightsDescription2": "Access your personal data and any other information indicated in Article 15.1 of the GDPR.",
        "userRightsDescription3": "Rectify your personal data that is inaccurate or incomplete in accordance with Article 16 of the GDPR.",
        "userRightsDescription4": "Delete your personal data in accordance with Article 17 of the GDPR.",
        "userRightsDescription5": "To limit the processing of your personal data in accordance with Article 18 of the GDPR.",
        "userRightsDescription6": "Request the portability of your data in accordance with Article 20 of the GDPR.",
        "userRightsDescription7": "Oppose the processing of your personal data in accordance with Article 21 of the GDPR.",
        "userRightsDescription8": "If you have given your consent for any specific purpose, you have the right to withdraw the consent given at any time, without affecting the lawfulness of the processing based on the consent prior to its withdrawal rrhh.",
        "userRightsDescription9": "You may exercise these rights by sending a reasoned and accredited communication to deyhome.mtm@gmail.com.",
        "userRightsDescription10": "You also have the right to lodge a complaint with the competent supervisory authority (www.aepd.es) if you consider that the processing does not comply with the regulations in force.",
        "legalInformation": "LEGAL INFORMATION",
        "legalInformationDescription": "The requirements of this Policy supplement, and do not replace, any other requirements existing under applicable data protection law, which shall prevail in any event. This Policy is subject to periodic review and may be amended by the Company at any time. When this occurs, we will notify you of any changes and ask you to re-read the most recent version of our Policy and confirm your acceptance."
    }
}