{
    "COMMON": {
        "title": "Dey Apps",
        "home": "Home",
        "infoMtm": "App MtM",
        "subtitle": "Home Software Developer",
        "contact": "Contact: deyhome.mtm@gmail.com",
        "footer": "Copyright © 2020 - David Jiménez - All rigths reserved",
        "iconDesignedBy": "Iconos diseñados por {{url}}",
        "MTM_LARGE": "Motor Track Manager",
        "MTM_FREE": "MtM Free",
        "light": "Claro",
        "dark": "Oscuro",
        "sky": "Cielo"
    },
    "HOME": {
        "titleInfoDeveloper": "Información del desarrollador",
        "descriptionInfoDeveloper": "Mi carrera profesional se desarrolla en su mayor parte en consultoría IT participando en grandes clientes internacionales. He evolucionado principalmente en el ámbito tecnológico de ingeniería del software, aunque también he participado en tareas de gestión de proyectos. Me considero una persona proactiva y con un objectivo de mejora profesional continua.",
        "titleProjects": "Proyectos",
        "descriptionProjects": "Aplicación para gestionar los mantenimientos de los vehículos personales sin necesidad de recordar cuándo se realizó una revisión y cuánto queda para el siguiente cambio de aceite de su moto o coche.",
        "descriptionLargeProjects": "Aplicación para gestionar los mantenimientos de los vehículos personales sin necesidad de recordar cuando se realizo una revisión y cuanto queda para el siguiente cambio de aceite de su moto o coche. Te ayuda a conocer en cualquier momento cuando deberías pasar la siguiente revisión y la vida de las piezas de tu vehículo configurando cada mantenimiento de una manera personalizada.",
        "titleTechnologicalSkills": "Habilidades tecnológicas",
        "descriptionTechnologicalSkills": "Mis inquietudes tecnológicas me han llevado a dominar herramientas y lenguajes de programación de Microsoft, como puede ser .NET Framework, .NET CORE, Entity Framework o Sql Server. También he tenido la posibilidad de evolucionar en tecnología de Google como Angular, firebase o Play Store. Además, como personalmente me gusta probar de todo, he podido trabajar con Ionic y Cordova para tecnogias moviles multiplataforma.",
        "titleHobbies": "Aficiones",
        "descriptionHobbies": "Por último, para que me puedan conocer un poco más, fuera del ámbito profesional paso mis ratos libres con el mundo del motor, me apasionan la creación de videojuegos con herramientas como UnReal y las tecnologias móviles con Android. Para cuidarme un poquito, me entretengo con los deportes de aventura, senderismo, ciclismo de montaña, patinar, baloncesto, etc. Por supuesto, me encanta pasar tiempo con la familia y los amigos."
    },
    "INFO_MTM": {
        "titleExpensesVehicles": "Gastos por vehículo",
        "descriptionExpensesVehicles": "Gestiona y controla los gastos por cada vehículo o en conjunto. Una vez configurado todos tus vehículos y sus operaciones de mantenimiento en la aplicación podrás tener disponible unos gráficos con los gastos totales o también filtrando los datos que se deseen.",
        "titleCalendar": "Calendario",
        "descriptionCalendar": "Una de las tranquilidades de viajar en moto es saber que todos los mantenimientos están en regla. Con la ayuda del calendario podrás planificar las revisiones y prevenir posibles averías por no haber cambiado una pieza en su debido momento. Este calendario calcula la fecha en la que se debería pasar las revisiones configuradas en base a los kilómetros realizados",
        "titleExpensesReplacement": "Gastos por pieza",
        "descriptionExpensesReplacement": "Visualiza los gastos invertidos en tus vehículos por cada pieza reemplazada en los mantenimientos o averías. Una vez configurado tus vehículos y realizado algunos mantenimientos podrás comprobar en reportes los gastos totales o filtrados de las piezas utilizadas.",
        "titleNotifications": "Notificaciones",
        "descriptionNotifications": "La aplicación te permite definir mantenimientos personalizados para cada uno de tus vehículos. En base a estas configuraciones te notifica cuanto tiempo y kilómetros de vida tienen las piezas de tus vehículos.",
        "titleTechnologiesUsed": "Tecnologías utilizadas",
        "descriptionTechnologiesUsed": "Aplicación multiplataforma para Android y Windows 10. Implementada con los frameworks Ionic 6 y Angular 12. Se han utilizado librerías o plugins como Cordova y Sqlite. Con la ayuda de VS Code se ha podido desarrollar con los lenguajes de programación HTML5, CSS3, Typescript 4 y SQL. Se garantiza la mejor calidad de código utlilizando SonarQube.",
        "descriptionMtMFree": "La aplicación también está disponible gratuitamente pero con una funcionalidad reducida. Aún así con esta versión se puede utilizar el registro de vehículos, operaciones, una amplia gama de configuraciones para los mantenimientos y las notificaciones. Utilizando la aplicación completa se podría disfrutar de los avisos del calendario, control de gastos y resumen de mantenimientos y recambios."
    },
    "POLICY_PRIVACY": {
        "mtmPrivacyPolicy": "Política de privacidad Motor track Manager",
        "title": "POLITICA DE PRIVACIDAD",
        "lastUpdate": "Última actualización: Enero 2021",
        "userInformation": "INFORMACIÓN AL USUARIO",
        "userInformationDescription": "DeyApps, como Responsable del Tratamiento, le informa que, según lo dispuesto en el Reglamento (UE) 2016/679, de 27 de abril, (RGPD) y en la L.O. 3/2018, de 5 de diciembre, de protección de datos y garantía de los derechos digitales (LOPDGDD), trataremos su datos tal y como reflejamos en la presente Política de Privacidad. En esta Política de Privacidad describimos cómo recogemos sus datos personales y por qué los recogemos, qué hacemos con ellos, con quién los compartimos, cómo los protegemos y sus opciones en cuanto al tratamiento de sus datos personales. Esta Política se aplica al tratamiento de sus datos personales recogidos por la empresa para la prestación de sus servicios. Si acepta las medidas de esta Política, acepta que tratemos sus datos personales como se define en esta Política.",
        "contact": "CONTACTO",
        "company": "DeyApps",
        "companyContact": "deyhome.mtm@gmail.com",
        "mainPrinciples": "PRINCIPIOS CLAVE",
        "mainPrinciplesDescription1": "Siempre hemos estado comprometidos con prestar nuestros servicios con el más alto grado de calidad, lo que incluye tratar sus datos con seguridad y transparencia. Nuestros principios son:",
        "mainPrinciplesDescription2": "Legalidad: Solo recopilaremos sus Datos personales para fines específicos, explícitos y legítimos.",
        "mainPrinciplesDescription3": "Minimización de datos: Limitamos la recogida de datos de carácter personal a lo que es estrictamente relevante y necesario para los fines para los que se han recopilado.",
        "mainPrinciplesDescription4": "Limitación de la Finalidad: Solo recogeremos sus datos personales para los fines declarados y solo según sus deseos.",
        "mainPrinciplesDescription5": "Precisión: Mantendremos sus datos personales exactos y actualizados.",
        "mainPrinciplesDescription6": "Seguridad de los Datos: Aplicamos las medidas técnicas y organizativas adecuadas y proporcionales a los riesgos para garantizar que sus datos no sufran daños, tales como divulgación o acceso no autorizado, la destrucción accidental o ilícita o su pérdida accidental o alteración y cualquier otra forma de tratamiento ilícito.",
        "mainPrinciplesDescription7": "Acceso y Rectificación: Disponemos de medios para que acceda o rectifique sus datos cuando lo considere oportuno.",
        "mainPrinciplesDescription8": "Conservación: Conservamos sus datos personales de manera legal y apropiada y solo mientras es necesario para los fines para los que se han recopilado.",
        "mainPrinciplesDescription9": "Las transferencias internacionales: cuando se dé el caso de que sus datos vayan a ser transferidos fuera de la UE/EEE se protegerán adecuadamente.",
        "mainPrinciplesDescription10": "Terceros: El acceso y transferencia de datos personales a terceros se llevan a cabo de acuerdo con las leyes y reglamentos aplicables y con las garantías contractuales adecuadas.",
        "mainPrinciplesDescription11": "Marketing Directo y cookies: Cumplimos con la legislación aplicable en materia de publicidad y cookies.",
        "processingData": "RECOGIDA Y TRATAMIENTO DE SUS DATOS PERSONALES",
        "processingDataDescription1": "Las tipos de datos que se pueden solicitar en la aplicación serán unícamente para procesar los datos de mantenimiento del vehículo pero sin llegar nunca a identificar el propio vehículo ni al propieratio del mismo o del usuario de la aplicación. Estos datos se podrán extraer manualmente de la aplicación y será el usuario el que tenga total dominio sobre sus datos del vehículo para que puedan ser integrados en la misma aplicación pero en otro dispositivo distinto. La forma de guardar esta información será solicitando acceso a los las rutas de su dispositivo y poder dejar dicha información requerida en una localicación del mismo.",
        "processingDataDescription2": "En ningún caso se recopilaran y reenviarán automáticamente estos datos para ser procesados por servicios externos. En el caso de que se necesite algún dato personal siempre lo solicitaremos preeviamente y le informaremos con claridad de qué datos personales recogemos y con qué fin.",
        "legitimacy": "LEGITIMIDAD",
        "legitimacyDescription1": "De acuerdo con la normativa de protección de datos aplicable, sus datos personales podrán tratarse siempre que:",
        "legitimacyDescription2": "Nos ha dado su consentimiento a los efectos del tratamiento. Por supuesto podrá retirar su consentimiento en cualquier momento.",
        "legitimacyDescription3": "Por requerimiento legal.",
        "legitimacyDescription4": "Por existir un interés legítimo que no se vea menoscabado por sus derechos de privacidad, como por ejemplo el envío de información comercial bien por suscripción a nuestra newsletter o por su condición de cliente.",
        "legitimacyDescription5": "Por se necesaria para la prestación de alguno de nuestros servicios mediante relación contractual entre usted y nosotros.",
        "comunicationData": "COMUNICACIÓN DE DATOS PERSONALES",
        "comunicationDataDescription": "Los datos pueden ser comunicados a empresas relacionadas con DeyApps para la prestación de los diversos servicios en calidad de Encargados del Tratamiento. La empresa no realizará ninguna cesión, salvo por obligación legal.",
        "userRights": "SUS DERECHOS",
        "userRightsDescription1": "En relación con la recogida y tratamiento de sus datos personales, puede ponerse en contacto con nosotros en cualquier momento para:",
        "userRightsDescription2": "Acceder a sus datos personales y a cualquier otra información indicada en el Artículo 15.1 del RGPD.",
        "userRightsDescription3": "Rectificar sus datos personales que sean inexactos o estén incompletos de acuerdo con el Artículo 16 del RGPD.",
        "userRightsDescription4": "Suprimir sus datos personales de acuerdo con el Artículo 17 del RGPD.",
        "userRightsDescription5": "Limitar el tratamiento de sus datos personales de acuerdo con el Artículo 18 del RGPD.",
        "userRightsDescription6": "Solicitar la portabilidad de sus datos de acuerdo con el Artículo 20 del RGPD.",
        "userRightsDescription7": "Oponerse al tratamiento de sus datos personales de acuerdo con el artículo 21 del RGPD.",
        "userRightsDescription8": "Si ha otorgado su consentimiento para alguna finalidad concreta, tiene derecho a retirar el consentimiento otorgado en cualquier momento, sin que ello afecte a la licitud del tratamiento basado en el consentimiento previo a su retirada rrhh.",
        "userRightsDescription9": "Puede ejercer estos derechos enviando comunicación, motivada y acreditada, a deyhome.mtm@gmail.com",
        "userRightsDescription10": "También tiene derecho a presentar una reclamación ante la Autoridad de control competente (www.aepd.es) si considera que el tratamiento no se ajusta a la normativa vigente.",
        "legalInformation": "INFORMACIÓN LEGAL",
        "legalInformationDescription": "Los requisitos de esta Política complementan, y no reemplazan, cualquier otro requisito existente bajo la ley de protección de datos aplicable, que será la que prevalezca en cualquier caso. Esta Política está sujeta a revisiones periódicas y la empresa puede modificarla en cualquier momento. Cuando esto ocurra, le avisaremos de cualquier cambio y le pediremos que vuelva a leer la versión más reciente de nuestra Política y que confirme su aceptación."
    }
}